In [2]:
import numpy as np
import pandas as pd

df_test=pd.read_csv(r'C:\Users\PoYu\jupyter\Example_and_data\Part02\titanic_test.csv')
df_train=pd.read_csv(r'C:\Users\PoYu\jupyter\Example_and_data\Part02\titanic_train.csv')

df_train.shape

(891, 12)

In [3]:
#重組資料成為訓練/預測用格式
train_Y=df_train['Survived']
ids=df_test['PassengerId']
df_train=df_train.drop(['PassengerId','Survived'],axis=1)
df_test=df_test.drop(['PassengerId'],axis=1)
df=pd.concat([df_train,df_test])
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# 秀出資料欄位的類型與數量
dtype_df = df.dtypes.reset_index()
dtype_df.columns = ["Count", "Column Type"]
dtype_df = dtype_df.groupby("Column Type").aggregate('count').reset_index()
dtype_df

  Column Type  Count
0       int64      3
1     float64      2
2      object      5

In [8]:
#確定只有 int64, float64, object 三種類型後, 分別將欄位名稱存於三個 list 中
int_features = []
float_features = []
object_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64':
        float_features.append(feature)
    elif dtype == 'int64':
        int_features.append(feature)
    else:
        object_features.append(feature)
print(f'{len(int_features)} Integer Features : {int_features}\n')
print(f'{len(float_features)} Float Features : {float_features}\n')
print(f'{len(object_features)} Object Features : {object_features}')

3 Integer Features : ['Pclass', 'SibSp', 'Parch']

2 Float Features : ['Age', 'Fare']

5 Object Features : ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [19]:
df[int_features].agg(['max','mean','nunique'])

           Pclass     SibSp     Parch
max      3.000000  8.000000  9.000000
mean     2.294882  0.498854  0.385027
nunique  3.000000  7.000000  8.000000

In [20]:
df[float_features].agg(['max','mean','nunique'])

               Age        Fare
max      80.000000  512.329200
mean     29.881138   33.295479
nunique  98.000000  281.000000

In [22]:
df[object_features].agg(['max','mean','nunique'])

                                Name   Sex     Ticket  Cabin  Embarked
max      van Melkebeke, Mr. Philemon  male  WE/P 5735    NaN       NaN
nunique                         1307     2        929  186.0       3.0

In [24]:
#作業1 物件類型無法求得平均值
df[object_features].mean()

Series([], dtype: float64)

In [ ]:
#作業2